## Plan Result (ptl_jenkins)




<pre><code>Plan: 2 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment
  * module.postgresql.terraform_data.trigger_password_reset
* Update
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_cosmosdb_sql_container.container[&#34;pipeline-metrics&#34;]
  * azurerm_cosmosdb_sql_container.cve-reports
  * azurerm_key_vault_secret.logicappsecret
  * module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow
  * module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_cosmosdb_account.cosmosdb will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "cosmosdb" {
        id                                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
        name                                     = "pipeline-metrics"
        tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (32 unchanged attributes hidden)

      + identity {
          + identity_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/monitoring-cftptl-intsvc-mi",
            ]
          + type         = "UserAssigned"
        }

        # (5 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_container.container["pipeline-metrics"] will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "container" {
      - default_ttl           = 63072000 -> null
        id                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics/sqlDatabases/jenkins/containers/pipeline-metrics"
        name                  = "pipeline-metrics"
        # (8 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_container.cve-reports will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "cve-reports" {
      - default_ttl           = 15768000 -> null
        id                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics/sqlDatabases/jenkins/containers/cve-reports"
        name                  = "cve-reports"
        # (8 unchanged attributes hidden)

      - timeouts {}

        # (3 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_role_assignment.monitoring_mi_assignment will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "monitoring_mi_assignment" {
      + account_name        = "pipeline-metrics"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e28ed5a8-2b50-436b-a0ee-288491c9b51b"
      + resource_group_name = "pipelinemetrics-database-prod"
      + role_definition_id  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pipelinemetrics-database-prod/providers/Microsoft.DocumentDB/databaseAccounts/pipeline-metrics"
    }

  # azurerm_key_vault_secret.logicappsecret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "logicappsecret" {
        id                      = "https://cftptl-intsvc.vault.azure.net/secrets/github-jenkins-ptl-logicapp/9f479f27b69349ea956a3b864b214e9e"
        name                    = "github-jenkins-ptl-logicapp"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.jenkins-webhook-relay.azurerm_logic_app_workflow.logic_app_workflow will be updated in-place
  ~ resource "azurerm_logic_app_workflow" "logic_app_workflow" {
        id                               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Logic/workflows/github-jenkins-cft-ptl"
        name                             = "github-jenkins-cft-ptl"
      ~ parameters                       = {
          - "$connections" = jsonencode(
                {
                  - servicebus_1 = {
                      - connectionId   = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Web/connections/github-sb-jenkins-con"
                      - connectionName = "servicebus-connection"
                      - id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Web/locations/uksouth/managedApis/servicebus"
                    }
                }
            ) -> null
        }
        tags                             = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
      ~ workflow_parameters              = {
          - "$connections" = jsonencode(
                {
                  - defaultValue = {}
                  - type         = "Object"
                }
            ) -> null
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jenkins-webhook-relay.azurerm_resource_group_template_deployment.logic_app_deployment will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "logic_app_deployment" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/github-jenkins-cft-ptl-rg/providers/Microsoft.Resources/deployments/logic-app-deployment"
        name                = "logic-app-deployment"
      ~ output_content      = jsonencode(
            {
              - callbackUrl = {
                  - type  = "String"
                  - value = "https://prod-13.uksouth.logic.azure.com:443/workflows/6dbd45e892a5401983aa1b29798de313/triggers/manual/paths/invoke?api-version=2017-07-01&sp=%2Ftriggers%2Fmanual%2Frun&sv=1.0&sig=x9WZiqvdbTeaD9XvNBW7pSJE-lKxKop5KcHKwdXnTc4"
                }
            }
        ) -> (known after apply)
      ~ parameters_content  = jsonencode(
          ~ {
              - rg                     = {
                  - value = ""
                }
              - servicebus_queue       = {
                  - value = "jenkins"
                }
                # (6 unchanged attributes hidden)
            }
        )
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (3 unchanged attributes hidden)
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + output = (known after apply)
    }

Plan: 2 to add, 6 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"ptl_jenkins","Vars":{}} -->